# Free Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointSetIterator..::..Free Method
IPointSetIterator Interface See Also
---
Use this method to discard any resources consumed by the iterator. Revit will call it when done using the iterator.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
void Free()
```

Visual Basic
---
```text
Sub Free
```

Visual C++
---
```text
void Free()
```

# See Also
IPointSetIterator Interface
Autodesk.Revit.DB.PointClouds Namespace